import com.github.jikyo.romaji.Transliterator
import dev.mr3n.romajikt.RomajiConversion
import org.junit.jupiter.api.Test
import java.text.Normalizer
import kotlin.test.assertEquals

class RomajiConversion {

    private val checkRomajiTypePrefix = "きゃあきぃいきゅうきぇえきょおぎゃぎぃぎゅぎぇぎょどうさんい"

    /**
     * texts by wikipedia
     */
    private val test = listOf(
        "KOTLINは、ろしあ・さんくとぺてるぶるくにある、じぇっとぶれいんずのけんきゅうじょでうまれた。じぇっとぶれいんずしゃはJAVA、RUBY、PYTHONなどのぷろぐらみんぐげんごによるかいはつかんきょうなどをかいはつしてはんばいしてきた。KOTLINは、どうしゃのけいけんをいかしJAVAをもっとかんけつ・あんぜんになるようにかいりょうしたさんぎょうりようむけはんようげんごとしてかいはつされ、２０１１ねん７がつ２０にちにはっぴょうされた。JAVAかそうましんじょうでどうさするため、JAVAでかかれたぷろぐらむとどうていどにはやくこんぱいるされどうていどにはやくどうさするとしている。JAVAにのぞまれているきのうであってもごかんせいをたもつためにじつげんできていないきのうや、しょうらいのJAVAのしようでじつげんがよていされているきのうから、ゆうようとおもわれるきのうをさいようした。また、JAVAかそうましんでうごくてんでにているすくりぷとげんごGROOVYやかんすうがたぷろぐらみんぐげんごのようそがつよいSCALAから、きのうやかんいきほう（とういこうぶん）をさいようした。そのほか、じぇねりくすのこうぶんなどでC#のえいきょうをうけているぶぶんもある",
        "えいきょうはんいはかくだんにひろがっているにゃんよ",
        "かんとうちほうでは、うけぐちのとうぶけいじょうにゆらいするくちぼそ（くちさい）のべつめいでもしられる。かんさいちほうではむぎつくをくちぼそということがあり、にいがたけんなどではまがれいをさすなど、かれいかのさかなをさすちほうもある。ほかのちほうめいとして、やなぎもろこ（ぎふ）、いしもろこ（しが）、やなぎはや（ぐんま）などもある。",
        "ぜんちょう8cmぜんご。さいだい11cmだが、しいくかではさらにおおがたかすることもある。たいしょくはぎんはくしょくでかんぜんなそくせんをもち、がわせんにそって1ほんのめいりょうなこくしょくたてくだりがはいる。ただしたてくだりはせいちょうにつれうすれてしょうしつしたり、もともとないこたいもそんざいする。きんえんしゅのしないもつごやうしもつごはそくせんがふかんぜんなてんが、もつごとのがいけんじょうはっきりしたそういである。たもろこにもにるが、もつごにはくちひげがなく、たもろこのほうがずんどうたいけいをしていることでみわけられる。",
        "みょうが（みょうが）とは、えどじだいにやまのこうみなどをりようしたり、えいぎょうなどのめんきょのだいしょうとしてばくふやはんにたいしてしはらったりしたそぜいのいっしゅ。きんせんでしはらわれることがおおかったために、みょうがきん（みょうがきん）・みょうがえい（みょうがえい、「えい」＝えいらくみちたか）ともよばれている。",
        "ほんらい、「みょうが」とはみょうりとどうぎごで、しんぶつからのかごのいみである。みょうがのきがんあるいはみょうがをうけたことにたいするしゃれいとしてじいんやじんじゃにほうのうされたきんせんやぶっしのことも「みょうが」としょうするようになった。あとにりょうしゅけんりょくもじこをりょうみんのひごしゃとしてのおんけい（こくおん）をきょうちょうして、これをこうじつにねんぐをおさめないしょうこうぎょうしゃにたいしてのうみんのねんぐにそうとうするみょうがをもとめるようになった。さらにりょうしゅけんりょくのきょかがひつようとされるこうざんろうどうやくじらなどのほかくなどりょうしゅがしはいするやまのこうみからなんらかのりえきをえたものにからもみょうがをちょうしゅうするようになった。これはのうみんがりょうしゅがしはいするたはたでろうどうこうい（こうさく）をいってねんぐをおさめるだいしょうとしてりょうしゅからのひごをうけるというかんけいをそのほかのりょうみんにかくだいしたものともいえる。",
        "にたようなそぜいにうんじょうがそんざいする。うんじょうもしょうこうぎょうしゃなどにかされたそぜいであるが、「うんじょうはさいしょからいっていのきんがくをのうふするようにさだめられているがみょうがにはそれがない」、「うんじょうはりょうしゅがふたんしゃにめいじておさめさせるものであるが、みょうがはふたんしゃがりょうしゅによるみょうがであるこくおんにたいするじしゅてきなほうのうのていさいをとっていた（もっともそれがほんとうにじしゅてきであるかどうかはべつもんだいである）」、「こものなり・うんじょうはまくはんせいしょきからのそぜいで、みょうがはかぶなかまけっせいをはじめとしてこうせいにあらたにふかされたもの」などのせつがあるが、じったいはみょうがにたいしてもいっていがくがさだめられるばあいもあり、「うんじょうといもみょうがえいというもどうようたり（ちゅうりゃく）、いずれをとなうへてもくるしからず」とした『ちほうはんれいろく』のきじゅつがちかいものであったとかんがえられている。",
        "もっともだいひょうてきなものとしてかぶなかまのけっせいじにりょうしゅからどくせんてきなえいぎょうとっけんをみとめられただいしょうとしておさめるみょうががある。にんかのさいしょのとしにはたがくのみょうがをのうふ（はつねんきん/しょねんぎん）して、いごはしょうがくのみょうがをまいとしのうふ（としどしきん/としどしぎん）することとなっていた。のうふほうほうとしてはきんかによるきんだて・ぎんかによるぎんだておよびひつようにおうじてのりょうしゃのこんごうのばあいがあり、ふたんはなかまにはいったかくこうせいいんがきょうどうでふたんした。てんぽうのかいかくのさいにかぶなかまが一じはいしされたさいにみょうがもめんじょされ、あとにかぶなかまはさいこうされたがかぶなかまにたいするみょうがのふかはおこなわれなくなった。",
        "にほんでは、てれびやらじお、えいがなどのほうそう、しょうせつやまんが、しんぶんなどのしゅっぱんのぶんやでも、にほんごがつかわれることがほとんどである。こくがいのどらまやえいががほうそうされるばあいでも、きほんてきにはにほんごにやくし、じまくをつけたりこえをあてたりしてからほうそうされるなど、うけてがにほんごのみをりかいすることをぜんていとしてさくせいされる。げんごのままほうそう・しゅっぱんされるものもそんざいするが、それらはがいこくむけにはっぴょうされるぜんていのろんぶん、もしくはにほんざいじゅうのがいこくじん、あるいはげんごのがくしゅうしゃなどかぎられたひとをたいしょうとしており、だいたすうのにほんじんにむけたものではない。"
    )

    @Test
    fun checkRomaji() {

        var checks = 0

        test.forEach { text ->
            val normalizedText = Normalizer.normalize("${checkRomajiTypePrefix}:${text}", Normalizer.Form.NFKC)
            val romajiList = Transliterator.transliterate(normalizedText)
            romajiList.removeAll { it.contains("'") }
            romajiList.removeAll { s -> !s.split(":")[0].contains("aa") }
            romajiList.removeAll { s -> !s.split(":")[0].contains("ii") }
            romajiList.removeAll { s -> !s.split(":")[0].contains("uu") }
            romajiList.removeAll { s -> !s.split(":")[0].contains("ee") }
            romajiList.removeAll { s -> !s.split(":")[0].contains("oo") }
            romajiList.removeAll { s -> !s.split(":")[0].contains("ou") }
            romajiList.removeAll { s -> !s.split(":")[0].contains("sanni") }

            romajiList.forEach { romaji ->
                val normalizedJapanizedRomaji = Normalizer.normalize(RomajiConversion.romajiToKana(romaji,false), Normalizer.Form.NFKC)
                assertEquals(normalizedText.removePrefix(checkRomajiTypePrefix), normalizedJapanizedRomaji.removePrefix(checkRomajiTypePrefix),romaji)
                checks++
            }
        }

        println("passed $checks checks.")
    }
}